{
  "_name_or_path": "google/tapas-base-finetuned-wtq",
  "aggregation_labels": {
    "0": "NONE",
    "1": "SUM",
    "2": "AVERAGE",
    "3": "COUNT"
  },
  "aggregation_loss_weight": 1.0,
  "aggregation_temperature": 1.0,
  "allow_empty_column_selection": false,
  "answer_loss_cutoff": 0.664694,
  "answer_loss_importance": 1.0,
  "architectures": [
    "TapasForQuestionAnswering"
  ],
  "attention_probs_dropout_prob": 0.1,
  "average_approximation_function": "ratio",
  "average_logits_per_cell": false,
  "cell_selection_preference": 0.207951,
  "disable_per_token_loss": false,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "huber_loss_delta": 0.121194,
  "init_cell_selection_weights_to_zero": true,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_num_columns": 32,
  "max_num_rows": 64,
  "max_position_embeddings": 1024,
  "model_type": "tapas",
  "no_aggregation_label_index": 0,
  "num_aggregation_labels": 4,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "positive_label_weight": 10.0,
  "reset_position_index_per_cell": true,
  "select_one_column": true,
  "softmax_temperature": 1.0,
  "temperature": 0.0352513,
  "transformers_version": "4.13.0.dev0",
  "type_vocab_size": [
    3,
    256,
    256,
    2,
    256,
    256,
    10
  ],
  "type_vocab_sizes": [
    3,
    256,
    256,
    2,
    256,
    256,
    10
  ],
  "use_answer_as_supervision": true,
  "use_gumbel_for_aggregation": false,
  "use_gumbel_for_cells": false,
  "use_normalized_answer_loss": false,
  "vocab_size": 30522
}
